blog-rails/app/controllers/posts_controller.rb

  def edit
    @max_post_number = Post.count+1
---
SELECT COUNT(*) FROM "posts"

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("created_at", "number", "tenant_id", "text", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2015-04-28 18:50:18.711532"], ["number", 1], ["tenant_id", 1], ["text", "novo"], ["updated_at", "2015-04-28 18:50:18.711532"]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "text" = ?, "updated_at" = ? WHERE "posts"."id" = 1  [["text", "1 changed"], ["updated_at", "2015-04-28 15:24:32.732861"]]