blog-rails/app/views/posts/index.html.erb


<%= content_tag "div", id: "js_data", data: {posts: Post.limit(10)} do %>
---
SELECT "posts".* FROM "posts"